{
  "HoraFacture": {
    "title": "Hora-Facture",
    "link": "/projects/HoraFacture",
    "desc": "Outil de génération de facture par lien Ical",
    "gitSrc": "https://github.com/EnzoDiGiovanni/Hora-Facture",
    "date": "2025",
    "imgSrc": "/images/horafacture.png",
    "technos": ["Laravel"],
    "tags": [
      "Développement Back-End",
      "Projet de spécialité",
      "Application Web",
      "API"
    ],
    "context": "Dans le cadre de ma formation pour un projet de spécialité, j'ai développé un projet complet nommé Hora Facture, une application de gestion de factures pour freelances et indépendants.",
    "objective": "Mon objectif était de créer une application Laravel robuste et moderne, tout en améliorant mes compétences full-stack, notamment en back-end PHP et en intégration front-end avec TailwindCSS.",
    "challenge": "Le projet a été entièrement conçu en autonomie : création de toutes les pages (clients, factures, dashboard), intégration d'une API externe pour importer des événements d'un calendrier iCal, mise en place de règles de sécurité par utilisateur, et gestion des relations complexes entre utilisateurs, clients, factures et lignes de factures.",
    "result": "Hora Facture est une application fonctionnelle permettant la création, la visualisation, la modification et la suppression de clients et de factures, avec génération automatique de lignes de factures à partir d'événements iCal, affichage dynamique de statistiques sur le dashboard, et une interface responsive en dark/light mode.",
    "linkToFutur": "Ce projet m'a permis de perfectionner mes bases en Laravel et Tailwind, et me prépare pour des projets plus ambitieux en full-stack, notamment avec la volonté d'intégrer des fonctionnalités plus avancées comme des exports PDF et des systèmes de paiement en ligne."
  },
  "APIREST": {
    "title": "API REST",
    "link": "/projects/APIREST",
    "desc": "Ma première API REST créée en GO / Postman ",
    "gitSrc": "https://github.com/EnzoDiGiovanni/Rest-API-Golang",
    "date": "2024",
    "imgSrc": "/images/restapi.png",
    "technos": ["Golang"],
    "tags": [
      "Développement Back-End",
      "Projet personnel",
      "API REST",
      "Postman"
    ],
    "context": "Pour explorer un langage back-end qui me correspond, j'ai entrepris la création de mon tout premier projet en Go.",
    "objective": "Ce projet vise à renforcer mes compétences en back-end. Dans mon parcours pour devenir full stack, je veux exceller dans ces deux domaines.",
    "challenge": "Partant de zéro, j'ai suivi un tutoriel complet, en modifiant et expérimentant chaque étape pour m'approprier ce langage.",
    "result": "Le projet aboutit à une API REST fonctionnelle en Go, permettant la gestion complète de livres avec les opérations CRUD : création, lecture, modification et suppression.",
    "linkToFutur": "Par curiosité et dans un esprit d'apprentissage, j'ai voulu tester Go, sans intention de l'utiliser comme langage back-end principal."
  },
  "B2SEOMDS": {
    "title": "B2SEOMDS",
    "link": "/projects/B2SEOMDS",
    "desc": "Challenge SEO sur un mot-clé aléatoire",
    "gitSrc": "https://github.com/johan-jnn/b2seomds",
    "projectLink": "https://cheh.johan-janin.com/",
    "date": "2024",
    "imgSrc": "/images/b2seomds.webp",
    "technos": ["HTML", "CSS", "Svelte"],
    "tags": ["Développement Front-End", "Projet marketing digital", "Seo"],
    "context": "Dans le cadre d'un projet de cours en Marketing Digital, nous devions concevoir un site optimisé pour être classé premier sur Google en termes de SEO sur un mot-clé inventé.",
    "objective": "L’objectif était d’atteindre la première position sur Google afin d’obtenir la meilleure note possible.",
    "challenge": "Avec mon équipe, nous avons réfléchi aux meilleures stratégies pour obtenir le meilleur résultat. Nous avons choisi de tout développer en code natif, car l’utilisation de WordPress, bien que pratique, réduit considérablement les performances du site.",
    "result": "Nous avons remporté le défi malgré des problèmes d’URL rencontrés par d’autres équipes. Notre site a obtenu un score parfait de 100 sur Google PageSpeed Insights.",
    "linkToFutur": "Ce projet m’a permis de mieux comprendre le SEO, un élément crucial dans la création de sites internet. Ces compétences me seront précieuses pour améliorer le classement des sites à l’avenir."
  },
  "pokedex": {
    "title": "Pokédex",
    "link": "/projects/pokedex",
    "desc": "Pokédex créé en Svelte",
    "gitSrc": "https://github.com/EnzoDiGiovanni/Pokedex-2.0",
    "date": "2024",
    "imgSrc": "/images/pokedex.webp",
    "technos": ["HTML", "CSS", "Svelte"],
    "tags": ["Front-end", "Projet personnel", "API", "Développement web"],
    "context": "Dans le cadre de mon apprentissage du développement web, j'ai décidé de créer un Pokédex pour approfondir mes compétences en JavaScript.",
    "objective": "L’objectif principal était de me familiariser avec l’utilisation des API en JavaScript, en particulier avec la méthode `fetch`, tout en réalisant un projet amusant et interactif.",
    "challenge": "Le principal défi a été de comprendre et manipuler les données reçues depuis une API. L’apprentissage de la structure JSON, notamment la distinction entre les objets et les tableaux, a été essentiel pour afficher correctement les informations des Pokémon.",
    "result": "Le projet a été un succès, j'ai réussi à développer un Pokédex fonctionnel affichant les données des Pokémon avec une navigation fluide et une interface intuitive.",
    "linkToFutur": "Ce projet m’a permis d’acquérir une base solide pour l’intégration d’API dans mes futurs projets. Ces compétences seront essentielles pour des projets plus complexes, notamment ceux nécessitant des échanges de données dynamiques."
  }
}
